# ตัวดำเนินการทางคณิตศาสตร์
x = 10
y = 3

print("ผลบวก" , x+y)
print("ผลลบ" , x-y)
print("ผลคูณ", x*y)
print("ผลหาร",x/y)
print("หารปัดเศษ", x//y)
print("ยกกำลัง",x**y)
print("หารเอาเศษ",x%y)

#ตัวดำเนินการเปรียบเทียบ​

# นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียบกัน
# ชนิดข้อมูลเหมือนกัน
# คำตอบ 2 คำตอบ => จริง / เท็จ

x,y,z = 8, 7,5

# print("ค่า x มากกว่า y หรือไม่ ? : ",x>y)
# print("ค่า x น้อยกว่า y หรือไม่ ? :", x<y)
# print("ค่า x เท่ากับ y หรือไม่ ? :", x==y)
# print("ค่า x ไม่เท่ากับ y หรือไม่ ?",x!=y)

# print("ค่า x มากกว่า หรือ เท่ากับ ค่า y หรือไม่ ?",x>=y)
# print("ค่า x น้อยกว่า หรือ เท่ากับ ค่า y หรือไม่ ?", x<=y)

#และ
print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่ ? : ",x>y>z)
print("ค่า x น้อยกว่า y และ y น้อยกว่า z หรือไม่ ? : ",x<y<z)


#AND = และ
#OR = หรือ
#NOT = ไม่
x = (10>5) #ค่า x = bool
y = (10==5) #ค่า y = bool

z = (10>5) or (10==5)

print(not z)